
import numpy as np
#切片对象可以通过内置的 slice 函数
a = np.arange(10)
s = slice(2 ,7 ,2)   # 从索引 2 开始到索引 7 停止，间隔为2
print (a[s])
print("---------------")

#数组切片
a = np.arange(10)
b = a[2:7:2]   # 从索引 2 开始到索引 7 停止，间隔为 2
print(b)
print("---------------")

a = np.arange(10)  # [0 1 2 3 4 5 6 7 8 9]
b = a[5]
print(b)
print("---------------")

a = np.arange(10)
print(a[2:])
print("---------------")

a = np.arange(10)  # [0 1 2 3 4 5 6 7 8 9]
print(a[2:5])
print("---------------")

#多维数组同样适用上述索引提取方法：
a = np.array([[1,2,3],[3,4,5],[4,5,6]])
print(a)
# 从某个索引处开始切割
print('从数组索引 a[1:] 处开始切割')
print(a[1:])
print("---------------")


#切片还可以包括省略号 …，来使选择元组的长度与数组的维度相同。 如果在行位置使用省略号，它将返回包含行中元素的 ndarray。
a = np.array([[1,2,3],[3,4,5],[4,5,6]])
print (a[...,1])   # 第2列元素
print (a[1,...])   # 第2行元素
print (a[...,1:])  # 第2列及剩下的所有元素

